In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("Electronic_sales.csv")
df.head()

,Customer_ID,Age,Gender,Loyalty_Member,Product_Type,SKU,Rating,Order_Status,Payment_Method,Total_Price,Unit_Price,Quantity,Purchase_Date,Shipping_Type,Add_ons_Purchased,Add_on_Total
0,1000,53,Male,No,Smartphone,SKU1004,2,Cancelled,Credit Card,5538.33,791.19,7,20-03-24,Standard,"Accessory,Accessory,Accessory",40.21
1,1000,53,Male,No,Tablet,SKU1002,3,Completed,Paypal,741.09,247.03,3,20-04-24,Overnight,Impulse Item,26.09
2,1002,41,Male,No,Laptop,SKU1005,3,Completed,Credit Card,1855.84,463.96,4,17-10-23,Express,NaN,0.00
3,1002,41,Male,Yes,Smartphone,SKU1004,2,Completed,Cash,3164.76,791.19,4,09-08-24,Overnight,"Impulse Item,Impulse Item",60.16
4,1003,75,Male,Yes,Smartphone,SKU1001,5,Completed,Cash,41.50,20.75,2,21-05-24,Express,Accessory,35.56

In [3]:
df.describe()

,Customer_ID,Age,Rating,Total_Price,Unit_Price,Quantity,Add_on_Total
count,20000.000000,20000.000000,20000.000000,20000.000000,20000.000000,20000.000000,20000.000000
mean,10483.526550,48.994100,3.093950,3180.133419,578.631867,5.485550,62.244848
std,5631.732525,18.038745,1.223764,2544.978675,312.274076,2.870854,58.058431
min,1000.000000,18.000000,1.000000,20.750000,20.750000,1.000000,0.000000
25%,5478.000000,33.000000,2.000000,1139.680000,361.180000,3.000000,7.615000
50%,10499.500000,49.000000,3.000000,2534.490000,463.960000,5.000000,51.700000
75%,15504.000000,65.000000,4.000000,4639.600000,791.190000,8.000000,93.842500
max,19998.000000,80.000000,5.000000,11396.800000,1139.680000,10.000000,292.770000

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 16 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Customer_ID        20000 non-null  int64
 1   Age                20000 non-null  int64
 2   Gender             19999 non-null  object
 3   Loyalty_Member     20000 non-null  object
 4   Product_Type       20000 non-null  object
 5   SKU                20000 non-null  object
 6   Rating             20000 non-null  int64
 7   Order_Status       20000 non-null  object
 8   Payment_Method     20000 non-null  object
 9   Total_Price        20000 non-null  float64
 10  Unit_Price         20000 non-null  float64
 11  Quantity           20000 non-null  int64
 12  Purchase_Date      20000 non-null  object
 13  Shipping_Type      20000 non-null  object
 14  Add_ons_Purchased  15132 non-null  object
 15  Add_on_Total       20000 non-null  float64
dtypes: float64(3), int64(4), object(9)
memory usage: 2.4+ MB

In [5]:
# Convert date data type
df["Purchase_Date"]= df["Purchase_Date"].astype("datetime64[ns]")

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 16 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Customer_ID        20000 non-null  int64
 1   Age                20000 non-null  int64
 2   Gender             19999 non-null  object
 3   Loyalty_Member     20000 non-null  object
 4   Product_Type       20000 non-null  object
 5   SKU                20000 non-null  object
 6   Rating             20000 non-null  int64
 7   Order_Status       20000 non-null  object
 8   Payment_Method     20000 non-null  object
 9   Total_Price        20000 non-null  float64
 10  Unit_Price         20000 non-null  float64
 11  Quantity           20000 non-null  int64
 12  Purchase_Date      20000 non-null  datetime64[ns]
 13  Shipping_Type      20000 non-null  object
 14  Add_ons_Purchased  15132 non-null  object
 15  Add_on_Total       20000 non-null  float64
dtypes: datetime64[ns](1), float64(3), int64(4), object(8)
memory usage: 2.4+ MB

In [7]:
# sales by Product_Type
df.groupby(["Product_Type",])["Total_Price"].sum().sort_values(ascending=False)

Product_Type
Smartphone    21516754.69
Smartwatch    14036273.06
Laptop        12296239.97
Tablet        11712000.41
Headphones     4041400.24
Name: Total_Price, dtype: float64

In [8]:
# Total sales By Gender
df.groupby(["Gender",])["Total_Price"].sum().sort_values(ascending=False)

Gender
Male      32188816.07
Female    31413177.98
Name: Total_Price, dtype: float64

In [9]:
# sales by Payment_Method
df.groupby(["Payment_Method",])["Total_Price"].sum().sort_values(ascending=False)

Payment_Method
Credit Card      18913772.92
Bank Transfer    12698262.09
PayPal           12500062.91
Debit Card        6736217.54
Paypal            6498781.08
Cash              6255571.83
Name: Total_Price, dtype: float64

In [10]:
# sales by Customer_ID
df.groupby(["Customer_ID",])["Total_Price"].sum().sort_values(ascending=False)

Customer_ID
16357    34563.70
16863    33035.92
13813    31830.16
11476    31077.61
12276    30961.18
           ...
5842        20.75
7349        20.75
5587        20.75
1129        20.75
1094        20.75
Name: Total_Price, Length: 12136, dtype: float64

In [11]:
# Average purchase quantities By SKUs
df.groupby(["Product_Type"])["Quantity"].mean().sort_values(ascending=False)

Product_Type
Headphones    5.560915
Tablet        5.519737
Smartwatch    5.498475
Smartphone    5.463366
Laptop        5.432671
Name: Quantity, dtype: float64

In [12]:
# Total Add on sales By product Type
df.groupby(["Product_Type"])["Add_on_Total"].sum().sort_values(ascending=False)

Product_Type
Smartphone    331025.55
Tablet        256240.42
Laptop        250025.31
Smartwatch    241423.36
Headphones    166182.32
Name: Add_on_Total, dtype: float64

In [13]:
# Total Add on sales By Gender
# find that female purchse more accessories than male customers
df.groupby(["Gender"])["Add_on_Total"].sum().sort_values(ascending=False)

Gender
Female    625641.31
Male      619255.65
Name: Add_on_Total, dtype: float64

In [14]:
# Sales by Loyalty Status
df.groupby(["Loyalty_Member"])["Total_Price"].sum().sort_values(ascending=False)

Loyalty_Member
No     49976751.24
Yes    13625917.13
Name: Total_Price, dtype: float64

In [15]:
# add on Sales by Loyalty Status
df.groupby(["Loyalty_Member"])["Add_on_Total"].sum().sort_values(ascending=False)

Loyalty_Member
No     974291.26
Yes    270605.70
Name: Add_on_Total, dtype: float64

In [16]:
# extract year from date columm
df["Year"] = df["Purchase_Date"].dt.year

In [17]:
# extract Month from date columm
df["Month"] = df["Purchase_Date"].dt.month

In [18]:
# extract Month Name from date columm
df["Month_Name"] = df["Purchase_Date"].dt.month_name()

In [19]:
# total Sales By year
df.groupby(["Year"])["Total_Price"].sum().sort_values(ascending=False)

Year
2024    56753105.76
2023     6849562.61
Name: Total_Price, dtype: float64

In [20]:
# total Sales By year and Month
df_grouped = df.groupby(["Year", "Month", "Month_Name"])["Total_Price"].sum().reset_index()

# Sort by Year and Month_Number to ensure the correct order
df_sorted = df_grouped.sort_values(by=["Year", "Month"])
df_sorted = df_sorted.drop("Month", axis=1)

print(df_sorted)

    Year Month_Name  Total_Price
0   2023    January    253367.55
1   2023   February    208044.34
2   2023      March    211371.53
3   2023      April    221431.53
4   2023        May    214958.43
5   2023       June    200144.62
6   2023       July    194448.81
7   2023     August    164148.96
8   2023  September    691027.07
9   2023    October   1561414.20
10  2023   November   1460809.52
11  2023   December   1468396.05
12  2024    January   5761554.56
13  2024   February   5400047.66
14  2024      March   5978239.43
15  2024      April   5674029.53
16  2024        May   6022976.05
17  2024       June   5790867.86
18  2024       July   6136940.48
19  2024     August   5959905.96
20  2024  September   4393907.93
21  2024    October   1916589.18
22  2024   November   1745846.41
23  2024   December   1972200.71

In [21]:
# Quantity Sold By year and Month
df_groupby = df.groupby(["Year","Month","Month_Name"])["Quantity"].sum().reset_index()
sorted_values = df_groupby.sort_values(by=["Year","Month"])
sorted_values = sorted_values.drop("Month",axis=1)
print(sorted_values)

    Year Month_Name  Quantity
0   2023    January       559
1   2023   February       398
2   2023      March       421
3   2023      April       444
4   2023        May       462
5   2023       June       512
6   2023       July       459
7   2023     August       348
8   2023  September      1500
9   2023    October      3391
10  2023   November      2963
11  2023   December      3255
12  2024    January      9512
13  2024   February      9115
14  2024      March     10043
15  2024      April      9621
16  2024        May     10178
17  2024       June      9549
18  2024       July     10221
19  2024     August      9938
20  2024  September      7322
21  2024    October      3166
22  2024   November      3078
23  2024   December      3256

In [22]:
# Quantity Sold by Product Type
df.groupby("Product_Type")["Quantity"].sum().sort_values(ascending=False)

Product_Type
Smartphone    32660
Tablet        22653
Smartwatch    21631
Laptop        21584
Headphones    11183
Name: Quantity, dtype: int64

In [23]:
# Most Orders by Shipping Type
df.groupby("Shipping_Type")["Product_Type"].count().sort_values(ascending=False)

Shipping_Type
Standard     6725
Express      3366
Overnight    3357
Same Day     3280
Expedited    3272
Name: Product_Type, dtype: int64

In [32]:
# Most Order Cancel by Payment Method
cancel_orders = df[df["Order_Status"] == "Cancelled"]
count_group = cancel_orders.groupby("Payment_Method")["Product_Type"].count()
sort = count_group.sort_values(ascending=False)
print(sort)

Payment_Method
Credit Card      1969
Bank Transfer    1112
PayPal           1049
Paypal            886
Debit Card        787
Cash              765
Name: Product_Type, dtype: int64

In [35]:
# Most Quantity Sold Payment Method
df.groupby("Payment_Method")["Quantity"].sum().sort_values(ascending=False)

Payment_Method
Credit Card      32031
Bank Transfer    18592
PayPal           18182
Paypal           13775
Debit Card       13668
Cash             13463
Name: Quantity, dtype: int64

In [25]:
df

,Customer_ID,Age,Gender,Loyalty_Member,Product_Type,SKU,Rating,Order_Status,Payment_Method,Total_Price,Unit_Price,Quantity,Purchase_Date,Shipping_Type,Add_ons_Purchased,Add_on_Total,Year,Month,Month_Name
0,1000,53,Male,No,Smartphone,SKU1004,2,Cancelled,Credit Card,5538.33,791.19,7,2024-03-20,Standard,"Accessory,Accessory,Accessory",40.21,2024,3,March
1,1000,53,Male,No,Tablet,SKU1002,3,Completed,Paypal,741.09,247.03,3,2024-04-20,Overnight,Impulse Item,26.09,2024,4,April
2,1002,41,Male,No,Laptop,SKU1005,3,Completed,Credit Card,1855.84,463.96,4,2023-10-17,Express,NaN,0.00,2023,10,October
3,1002,41,Male,Yes,Smartphone,SKU1004,2,Completed,Cash,3164.76,791.19,4,2024-09-08,Overnight,"Impulse Item,Impulse Item",60.16,2024,9,September
4,1003,75,Male,Yes,Smartphone,SKU1001,5,Completed,Cash,41.50,20.75,2,2024-05-21,Express,Accessory,35.56,2024,5,May
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
19995,19996,27,Female,No,Smartphone,SMP234,4,Completed,Bank Transfer,6838.08,1139.68,6,2024-06-15,Expedited,NaN,0.00,2024,6,June
19996,19996,27,Female,Yes,Laptop,LTP123,4,Cancelled,Credit Card,2697.28,674.32,4,2024-07-18,Standard,NaN,0.00,2024,7,July
19997,19996,27,Female,No,Headphones,HDP456,4,Completed,Bank Transfer,1805.90,361.18,5,2024-08-26,Standard,"Impulse Item, Extended Warranty, Accessory",198.98,2024,8,August
19998,19997,27,Male,No,Headphones,HDP456,1,Cancelled,Bank Transfer,2528.26,361.18,7,2024-06-01,Expedited,"Extended Warranty, Accessory",101.34,2024,6,June
19999,19998,27,NaN,Yes,Laptop,LTP123,4,Completed,Bank Transfer,674.32,674.32,1,2024-01-29,Expedited,NaN,0.00,2024,1,January